Simulations/Tests/1Turbina/3.5MMnodos/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (100 0 0)
    (100 50 0)
    (0 50 0)
    (0 0 50)
    (100 0 50)
    (100 50 50)
    (0 50 50)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (350 100 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (7 6 2 3)
            (0 1 5 4)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (3 2 1 0)
        );
    }
    top
    {
        type patch;
        faces
        (
           (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
